stm32duino/Arduino_Core_STM32/variants/DISCO_F030R8/variant.h
/*
 *******************************************************************************
 * Copyright (c) 2018, STMicroelectronics
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

#ifndef _VARIANT_ARDUINO_STM32_
#define _VARIANT_ARDUINO_STM32_

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "PeripheralPins.h"

#ifdef __cplusplus
extern "C"{
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/
extern const PinName digitalPin[];

//P1 connector Right side (bottom view)
#define  PC13  0
#define  PC14  1
#define  PC15  2
#define  PF0  3
#define  PF1  4
#define  PC0  5
#define  PC1  6
#define  PC2  7
#define  PC3  8
#define  PA0  9
#define  PA1  10
#define  PA2  11
#define  PA3  12
#define  PF4  13
#define  PF5  14
#define  PA4  15
#define  PA5  16
#define  PA6  17
#define  PA7  18
#define  PC4  19
#define  PC5  20
#define  PB0  21
#define  PB1  22
#define  PB2  23
#define  PB10  24
#define  PB11  25
#define  PB12  26
//P2 connector Left side (bottom view)
#define  PB9  27
#define  PB8  28
#define  PB7  29
#define  PB6  30
#define  PB5  31
#define  PB4  32
#define  PB3  33
#define  PD2  34
#define  PC12  35
#define  PC11  36
#define  PC10  37
#define  PA15  38
#define  PA14  39
#define  PF7  40
#define  PF6  41
#define  PA13  42
#define  PA12  43
#define  PA11  44
#define  PA10  45
#define  PA9  46
#define  PA8  47
#define  PC9  48
#define  PC8  49
#define  PC7  50
#define  PC6  51
#define  PB15  52
#define  PB14  53
#define  PB13  54
// Duplicated pins in order to be aligned with PinMap_ADC
#define  PC_0_A  55
#define  PC_1_A  56
#define  PC_2_A  57
#define  PC_3_A  58
#define  PA_0_A  59
#define  PA_1_A  60
#define  PA_2_A  61
#define  PA_3_A  62
#define  PA_4_A  63
#define  PA_5_A  64
#define  PA_6_A  65
#define  PA_7_A  66
#define  PC_4_A  67
#define  PC_5_A  68
#define  PB_0_A  69
#define  PB_1_A  70
#define  PEND    71

// This must be a literal with the same value as PEND
#define NUM_DIGITAL_PINS        71
// This must be a literal with a value less than or equal to to MAX_ANALOG_INPUTS
#define NUM_ANALOG_INPUTS       16
#define NUM_ANALOG_FIRST        55

//On-board LED pin number
#define LED_BUILTIN             PC9 // LD3
#define LED_GREEN               LED_BUILTIN
#define LED_BLUE                PC8 // LD4

//On-board user button
#define USER_BTN                PA0

// SPI definitions
// SPI1 is used
#define PIN_SPI_SS              PA4
#define PIN_SPI_SS1             PC4
#define PIN_SPI_SS2             PB12
#define PIN_SPI_SS3             PC6
#define PIN_SPI_MOSI            PA7
#define PIN_SPI_MISO            PA6
#define PIN_SPI_SCK             PA5

// I2C Definitions
// I2C1 is used
#define PIN_WIRE_SDA            PB9
#define PIN_WIRE_SCL            PB8

// Timer Definitions
//Do not use timer used by PWM pins when possible. See PinMap_PWM.
#define TIMER_TONE              TIM6

//Do not use basic timer: OC is required
#define TIMER_SERVO             TIM3  //TODO: advanced-control timers don't work

// UART Definitions
#define SERIAL_UART_INSTANCE    1 // USART 1

// Mandatory for Firmata
#define PIN_SERIAL_RX           PA10
#define PIN_SERIAL_TX           PA9

#ifdef __cplusplus
} // extern "C"
#endif
/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR     Serial
#define SERIAL_PORT_HARDWARE    Serial
#endif

#endif /* _VARIANT_ARDUINO_STM32_ */
